0	typical	580
1	thank	643
2	network	25977
3	problem	8225
4	natural	1142
5	clas	81
6	dimension	1817
7	graph	1304
8	hidden	4777
9	subject	1160
10	adaptive	1567
11	computational	1636
12	tree	1297
13	hierarchical	582
14	average	2260
15	human	1380
16	simplicity	314
17	feed	591
18	condition	2139
19	henkle	14
20	order	4444
21	scope	77
22	detail	908
23	generalization	2345
24	profile	183
25	task	4010
26	defining	199
27	language	606
28	number	7614
29	statistical	1539
30	solution	2969
31	critical	489
32	representation	3739
33	responded	38
34	xor	217
35	characterize	154
36	additional	878
37	system	11076
38	stable	677
39	minimal	505
40	fully	659
41	electronic	251
42	pavel	23
43	straint	39
44	recognition	3853
45	learned	1351
46	experimental	1077
47	correlated	394
48	layer	5273
49	hint	304
50	test	3465
51	function	14704
52	final	954
53	technical	797
54	categories	290
55	assuming	435
56	ities	33
57	categorized	23
58	pattern	6214
59	potential	1515
60	training	9871
61	differently	58
62	input	13993
63	common	713
64	analysis	3042
65	weight	8576
66	randomly	801
67	starting	513
68	diversity	61
69	presented	1726
70	parity	227
71	correctly	517
72	experiment	3143
73	role	653
74	dimensional	2142
75	unit	9612
76	rules	1383
77	psychology	214
78	adapted	191
79	procedure	1497
80	bar	536
81	important	1482
82	initial	1911
83	rule	2269
84	result	8372
85	medical	179
86	ames	34
87	shared	209
88	technique	996
89	solid	474
90	tested	781
91	analyze	229
92	responses	912
93	computable	40
94	unlimited	33
95	distance	1896
96	approximates	132
97	response	2354
98	broad	188
99	international	639
100	develop	456
101	compared	1099
102	solu	28
103	call	826
104	categorization	85
105	output	8914
106	perform	1553
107	moore	307
108	specific	1064
109	learning	16075
110	func	222
111	national	401
112	reported	609
113	compute	1080
114	studied	516
115	correct	1278
116	model	18665
117	strategies	275
118	provide	1099
119	profiles	96
120	clustering	884
121	constraint	1802
122	performance	4861
123	cluster	1161
124	valiant	83
125	differences	479
126	dual	264
127	stanford	180
128	improved	619
129	find	1880
130	distribution	4961
131	area	793
132	report	1087
133	larger	999
134	architecture	2335
135	annual	179
136	found	1944
137	explain	326
138	represent	2225
139	linear	4603
140	classify	278
141	hon	11
142	category	433
143	considerable	191
144	discovered	96
145	society	302
146	defined	1960
147	forward	1296
148	dept	434
149	minimize	622
150	lead	1178
151	cover	305
152	real	2273
153	states	2129
154	question	599
155	non	3058
156	paper	2954
157	weighted	842
158	probability	4072
159	appeared	98
160	university	2125
161	object	2905
162	trained	2508
163	investigating	76
164	increase	820
165	set	11677
166	nip	279
167	data	11023
168	line	2358
169	cally	56
170	acknowledgement	632
171	gluck	71
172	layered	227
173	providing	261
174	slope	182
175	dark	176
176	worse	193
177	powerful	264
178	activation	1997
179	row	657
180	net	3582
181	programming	707
182	reversed	55
183	term	3973
184	favor	118
185	size	2745
186	modeling	1038
187	comprise	29
188	supported	714
189	relation	682
190	stimuli	831
191	medin	10
192	theory	2219
193	remaining	411
194	baum	202
195	finally	804
196	behave	68
197	finding	918
198	criterion	841
199	clear	488
200	achieved	795
201	examined	216
202	algorithm	11250
203	constraining	42
204	cognitive	571
205	differ	463
206	obtained	2234
207	deterministic	517
208	analyzing	124
209	likely	584
210	conference	853
211	consider	1989
212	theoretical	742
213	apparent	173
214	imposing	31
215	perturbation	434
216	determine	847
217	haussler	180
218	variety	455
219	bound	2228
220	comparing	300
221	suppose	397
222	minimum	1151
223	sum	1274
224	eventually	138
225	assumption	1228
226	hopefully	30
227	tion	1962
228	foundation	447
229	individual	981
230	explore	254
231	con	818
232	effect	2298
233	department	981
234	describe	762
235	account	803
236	imposed	124
237	respond	330
238	determined	1053
239	comm	46
240	involving	252
241	bob	13
242	study	1109
243	identical	591
244	identification	468
245	part	1920
246	valued	499
247	reducing	243
248	neural	12667
249	eliminate	128
250	conclusion	1004
251	represented	1048
252	consecutive	94
253	widely	195
254	candidate	343
255	binary	1291
256	closest	219
257	learn	2201
258	abu	79
259	assure	18
260	phases	231
261	dashed	362
262	incorrect	150
263	june	134
264	tenth	44
265	combination	1030
266	learnable	79
267	nodes	1746
268	eralization	36
269	multi	1228
270	labeled	499
271	trial	1176
272	form	3263
273	testing	691
274	increases	753
275	large	3325
276	complexity	1443
277	desired	1056
278	dnf	35
279	identify	304
280	directed	203
281	due	1570
282	biasing	34
283	rapidly	228
284	developed	807
285	analyses	107
286	behavior	1640
287	assigning	97
288	selected	808
289	effectiveness	126
290	classification	2673
291	type	1251
292	solving	433
293	representing	614
294	ject	36
295	mostafa	79
296	black	324
297	approximated	384
298	comment	166
299	desirable	188
300	process	2519
301	motivated	217
302	error	8343
303	learner	418
304	artificial	1058
305	symptom	16
306	demonstrated	459
307	expected	1311
308	memory	2184
309	detailed	379
310	exist	953
311	concluded	27
312	light	702
313	expression	750
314	conclude	149
315	predictable	56
316	parameter	6472
317	goal	1135
318	independent	1966
319	depend	1287
320	effort	229
321	dif	105
322	performed	1191
323	computed	1177
324	instances	325
325	designated	35
326	types	794
327	point	6122
328	approach	3596
329	cases	1346
330	showed	373
331	aaa	20
332	significant	870
333	grant	632
334	lowest	171
335	mark	189
336	estimate	1983
337	previously	567
338	lack	189
339	consisted	254
340	predict	861
341	configuration	644
342	complete	739
343	examine	237
344	exclusive	69
345	surface	723
346	research	2005
347	cognition	211
348	consistent	674
349	obtain	1226
350	small	2808
351	overlap	452
352	tant	29
353	univer	28
354	main	731
355	generaliza	44
356	equally	230
357	determinant	65
358	applied	1704
359	reached	288
360	high	2480
361	sake	58
362	definition	658
363	tech	227
364	version	1215
365	condi	51
366	slo	12
367	asked	84
368	prefer	80
369	responding	73
370	sufficient	542
371	implementation	1179
372	include	597
373	phase	1818
374	viewed	378
375	examining	79
376	monotonic	152
377	equation	3498
378	adap	35
379	proportion	200
380	fourth	171
381	assignment	435
382	limited	783
383	probabilistic	711
384	sel	21
385	august	62
386	sampling	792
387	valid	341
388	gen	162
389	minimizing	458
390	application	2257
391	tally	13
392	characterizes	56
393	curves	923
394	enabled	32
395	upper	853
396	capable	296
397	times	1186
398	subset	784
399	threshold	2267
400	abstract	1652
401	similar	2347
402	journal	741
403	hold	596
404	generate	722
405	equal	1111
406	patterned	13
407	ing	1261
408	considered	890
409	failed	92
410	activity	2073
411	lowe	69
412	undesirable	33
413	preferences	73
414	nonlinear	1787
415	consist	1199
416	reduces	360
417	case	4355
418	bower	132
419	modeled	433
420	behaved	28
421	steve	51
422	categorize	25
423	half	482
424	called	1201
425	normal	817
426	involve	167
427	ical	84
428	seventh	29
429	terminate	35
430	group	1194
431	random	2437
432	space	4771
433	draft	31
434	van	479
435	edges	419
436	connectionist	895
437	judd	59
438	convenience	87
439	simple	2848
440	vector	6283
441	difficulty	263
442	disjunctive	14
443	ieee	1534
444	fact	1262
445	map	2743
446	ask	91
447	science	1805
448	acm	134
449	node	1855
450	solve	568
451	simulated	655
452	general	2213
453	basis	1743
454	nasa	66
455	properties	1543
456	curve	955
457	processes	776
458	briefly	208
459	quadratic	600
460	biological	751
461	diagnosis	135
462	nectivity	11
463	actual	804
464	structure	2398
465	submitted	209
466	ferent	57
467	san	886
468	continued	61
469	references	1525
470	define	1056
471	discussed	573
472	simu	27
473	mathematical	413
474	sity	53
475	rapid	204
476	discriminant	260
477	olution	12
478	recognizer	283
479	tive	189
480	researcher	190
481	transaction	390
482	connected	1005
483	cate	23
484	hamming	129
485	metric	547
486	achieve	555
487	descent	1025
488	cybernetic	165
489	generalize	261
490	introducing	167
491	approaches	1023
492	impor	34
493	similarity	609
494	nique	24
495	adding	402
496	encoded	322
497	neighborhood	424
498	maximizes	162
499	description	716
500	preliminary	242
501	lation	88
502	ran	179
503	focus	421
504	external	466
505	diego	247
506	conjunction	135
507	empirical	636
508	classified	340
509	rumelhart	653
510	discussion	1095
511	turning	70
512	considerably	172
513	ensemble	565
514	received	253
515	sequences	919
516	optimal	3036
517	choosing	390
518	alternative	527
519	introduction	1528
520	computer	2061
521	serially	20
522	gordon	74
523	chance	127
524	boolean	369
525	reflected	80
526	basic	864
527	left	1860
528	ist	24
529	experimen	23
530	indicative	24
531	assign	245
532	hebbian	513
533	window	856
534	perceptual	341
535	iteration	1504
536	recent	601
537	meeting	51
538	shapes	216
539	onr	93
540	mask	90
541	choice	878
542	difficult	954
543	unsupervised	584
544	image	3634
545	graduate	83
546	tomaso	18
547	mentioned	188
548	expansion	421
549	substitute	54
550	office	223
551	cortex	1333
552	disparity	304
553	depth	616
554	maintaining	102
555	gaussian	3369
556	kamp	12
557	update	1049
558	element	1521
559	pca	599
560	coded	147
561	variance	1511
562	difference	1415
563	sensitive	553
564	mit	1031
565	centered	399
566	mean	3970
567	interested	277
568	circuit	2214
569	square	704
570	computes	271
571	proc	1002
572	produce	765
573	reconstruction	455
574	reconstruct	86
575	nonlinearity	191
576	pair	1302
577	generalized	546
578	background	566
579	hoff	34
580	sci	230
581	formalized	32
582	matrix	2845
583	squared	673
584	clearly	557
585	zero	2127
586	uncorrelated	148
587	sigmoid	548
588	linearly	410
589	present	1976
590	correlation	1944
591	cor	148
592	coding	831
593	try	216
594	karhunen	21
595	purely	129
596	hinton	885
597	sloan	46
598	related	1049
599	scanning	55
600	pixel	1313
601	spatial	1388
602	optimality	141
603	implemented	712
604	variances	216
605	approximation	2727
606	converged	154
607	nature	771
608	seek	123
609	advanced	187
610	summed	138
611	svd	65
612	selectivity	266
613	filtered	194
614	studies	553
615	convergence	1591
616	feature	2880
617	images	2330
618	wescon	12
619	literature	307
620	pos	65
621	region	2240
622	field	3659
623	averaged	454
624	knowledge	1159
625	vertical	417
626	original	1128
627	center	1726
628	method	6532
629	switching	213
630	program	532
631	frequency	1713
632	constant	2190
633	maximal	300
634	eigenvector	323
635	special	670
636	put	284
637	min	456
638	stereogram	60
639	single	3457
640	nowlan	203
641	investigator	56
642	volume	586
643	lippmann	256
644	nato	23
645	block	1090
646	implication	148
647	train	1246
648	unsu	14
649	orthogonal	262
650	partial	378
651	poggio	300
652	sanger	137
653	rectification	32
654	ne43	10
655	principle	615
656	expect	369
657	supervised	645
658	yield	956
659	visual	2925
660	central	486
661	ponent	56
662	author	443
663	converges	371
664	infinite	394
665	pointed	76
666	shape	757
667	unfortunately	225
668	proven	158
669	sample	1716
670	linsker	184
671	provided	801
672	convolved	44
673	setting	629
674	squares	395
675	receptive	1061
676	nonlinearities	93
677	entirely	132
678	susceptible	27
679	exactly	596
680	natl	91
681	false	368
682	tivity	36
683	barrow	17
684	principal	655
685	multiplied	95
686	intelligence	464
687	review	388
688	auto	191
689	local	3383
690	heuristic	421
691	relationship	689
692	choose	642
693	samples	1144
694	sciences	302
695	oja	126
696	cmu	174
697	easier	188
698	bourlard	114
699	quantizing	15
700	nonlin	30
701	maximizing	228
702	organization	482
703	propose	485
704	presentation	404
705	interaction	852
706	development	722
707	bit	1379
708	overlapped	13
709	polarities	15
710	top	911
711	equivalent	902
712	assp	37
713	examples	2860
714	talk	63
715	edge	590
716	steady	223
717	usa	291
718	laboratory	417
719	cooper	125
720	operates	122
721	pages	920
722	widrow	105
723	sequence	1937
724	scientist	34
725	association	338
726	ralph	38
727	investigation	191
728	property	571
729	estimation	1612
730	orientation	1319
731	cat	327
732	design	886
733	pointing	92
734	sible	26
735	synaptic	1758
736	note	2127
737	discover	175
738	diagonal	545
739	stereo	121
740	intuitive	122
741	daca76	9
742	ability	699
743	pass	494
744	member	300
745	measure	1420
746	triangular	48
747	practice	479
748	feedforward	795
749	division	170
750	generated	1439
751	support	1069
752	allow	1562
753	ann	499
754	dot	436
755	decomposition	418
756	features	2725
757	alfred	9
758	information	5953
759	rate	3338
760	feedfor	23
761	simulation	2315
762	encouraging	90
763	quantized	82
764	organized	184
765	occur	975
766	positive	1535
767	component	3311
768	eft	14
769	level	3230
770	manuscript	62
771	procedures	276
772	values	4006
773	hughes	76
774	entries	110
775	elliptical	20
776	subspace	357
777	ward	79
778	remove	162
779	fixed	2261
780	backpropagation	824
781	contour	512
782	known	1722
783	magazine	43
784	decreasing	254
785	able	998
786	project	325
787	lower	1404
788	tract	60
789	aircraft	103
790	multilayer	432
791	assume	1392
792	ten	324
793	utility	220
794	negative	1147
795	total	1186
796	give	795
797	physiol	143
798	summarize	104
799	white	511
800	performing	362
801	n00014	131
802	john	507
803	want	244
804	singular	237
805	selec	26
806	need	1344
807	primate	137
808	interior	58
809	later	366
810	cell	4881
811	location	1615
812	imum	32
813	preferentially	24
814	proposed	1269
815	propagating	81
816	andrew	135
817	maximize	326
818	describes	414
819	makes	715
820	love	16
821	sponsored	37
822	scaled	247
823	minimizes	277
824	pervised	21
825	grid	579
826	encoder	136
827	suggest	973
828	greater	482
829	nonzero	121
830	army	27
831	decrease	439
832	mapping	1442
833	intuitively	123
834	bienenstock	64
835	fellowship	100
836	identity	298
837	interesting	675
838	modifying	73
839	converge	552
840	proportional	434
841	remain	597
842	planes	93
843	chosen	1367
844	efficient	890
845	com	777
846	idea	604
847	against	406
848	investigated	235
849	scale	1220
850	specificity	97
851	denker	245
852	notion	277
853	low	1830
854	boston	155
855	perhap	233
856	express	105
857	qualitative	163
858	terence	15
859	rectified	81
860	defense	40
861	class	2955
862	bottom	636
863	change	1406
864	transform	460
865	detect	351
866	munro	100
867	prediction	2687
868	agency	51
869	operator	679
870	measuring	149
871	ordered	141
872	press	1675
873	compare	573
874	arranged	119
875	cambridge	910
876	eigenvalues	327
877	requires	861
878	tom	80
879	think	123
880	according	1140
881	argument	295
882	precise	227
883	lost	126
884	computing	895
885	peo	10
886	neuron	6849
887	oriented	265
888	minimized	246
889	criticism	20
890	scientific	185
891	neuroscience	293
892	decreases	398
893	sutton	475
894	noise	4037
895	increased	524
896	ire	24
897	surround	297
898	edu	812
899	encodes	88
900	contract	135
901	acad	134
902	william	591
903	perceptron	958
904	vertically	46
905	encode	225
906	inn	40
907	sin	261
908	cix	10
909	naval	115
910	rich	107
911	log	1756
912	binocular	134
913	detection	993
914	approximate	863
915	implied	53
916	record	161
917	successive	227
918	linearity	134
919	principles	246
920	xxt	16
921	propagation	1533
922	possess	48
923	write	262
924	ple	80
925	allowed	366
926	monkey	303
927	suggestion	98
928	familiar	134
929	locally	515
930	ackley	47
931	subnetwork	83
932	reach	257
933	produces	425
934	arbitrary	787
935	alvis	17
936	create	257
937	loc	12
938	arrow	152
939	recorded	333
940	ment	332
941	arm	595
942	current	2862
943	step	3683
944	trunk	33
945	course	453
946	specifies	135
947	machine	1695
948	search	1458
949	robot	980
950	associative	631
951	miyata	37
952	touch	36
953	distances	344
954	extensive	138
955	jordan	725
956	position	2283
957	computation	2390
958	communication	499
959	peripheral	77
960	reachable	22
961	albeit	29
962	lin	223
963	rain	71
964	target	2466
965	channel	1358
966	gain	1159
967	success	296
968	max	626
969	joint	998
970	angle	428
971	previous	1327
972	reverses	13
973	environment	1140
974	performances	121
975	respect	1230
976	section	2446
977	answer	253
978	parallel	1366
979	reuse	25
980	dependent	941
981	needed	675
982	display	291
983	suffer	129
984	personal	85
985	teacher	546
986	suffice	45
987	accuracy	1010
988	backward	301
989	angles	177
990	open	403
991	side	612
992	longer	437
993	trying	112
994	avoiding	96
995	addition	927
996	kinematic	162
997	oscillation	508
998	balanced	107
999	competition	419
1000	successful	293
1001	recording	305
1002	end	839
1003	jolla	103
1004	action	2318
1005	body	243
1006	fail	257
1007	short	747
1008	gradient	2449
1009	hill	215
1010	future	714
1011	failures	63
1012	physic	386
1013	logarithmically	24
1014	similarly	368
1015	relevant	596
1016	ground	226
1017	experiences	96
1018	world	907
1019	spherical	87
1020	succeeded	25
1021	connection	2530
1022	consisting	389
1023	explored	223
1024	limitation	343
1025	reinforcement	1188
1026	translating	32
1027	supplying	18
1028	bell	325
1029	help	346
1030	translate	48
1031	possi	25
1032	inverse	802
1033	move	490
1034	delta	293
1035	largely	92
1036	repetition	100
1037	doctoral	23
1038	watching	10
1039	shoulder	24
1040	expanded	115
1041	emphasis	60
1042	moves	243
1043	signal	4261
1044	initialize	115
1045	occasionally	43
1046	propagate	96
1047	nates	12
1048	tail	95
1049	burr	57
1050	arise	190
1051	expressed	380
1052	serial	181
1053	strength	708
1054	incorporated	152
1055	deciding	39
1056	changed	203
1057	select	514
1058	shrink	51
1059	integrates	56
1060	modi	10
1061	posed	168
1062	influence	389
1063	avi	7
1064	situation	518
1065	integrated	402
1066	processing	3430
1067	distributed	1227
1068	reveal	164
1069	denote	796
1070	hanson	257
1071	institute	927
1072	pursue	16
1073	exploratory	67
1074	slowly	205
1075	actually	445
1076	mechanism	1058
1077	win	119
1078	place	518
1079	applies	162
1080	routine	43
1081	maximum	1714
1082	strictly	171
1083	uncover	19
1084	early	641
1085	approaching	46
1086	attractor	757
1087	shadow	35
1088	front	221
1089	reinf	15
1090	origin	274
1091	rest	261
1092	imal	18
1093	comparison	1190
1094	variable	1467
1095	orienting	9
1096	criticized	10
1097	close	765
1098	store	196
1099	feedback	1133
1100	construct	499
1101	arises	168
1102	rise	220
1103	usable	12
1104	supervision	31
1105	indication	79
1106	uniform	661
1107	push	54
1108	observing	108
1109	resulting	1194
1110	standard	1900
1111	radian	17
1112	tip	60
1113	gin	15
1114	inhibitory	747
1115	legal	96
1116	unpublished	56
1117	trivial	215
1118	interference	143
1119	greatly	173
1120	control	3725
1121	embedded	166
1122	inability	37
1123	satisfies	266
1124	superimposed	85
1125	memorandum	12
1126	rein	42
1127	summarizes	74
1128	demonstrates	181
1129	hit	182
1130	simply	772
1131	feldman	38
1132	dynamic	3487
1133	backpropagate	11
1134	motor	1097
1135	asymptotic	514
1136	matic	17
1137	logarithmic	131
1138	internal	986
1139	evident	114
1140	run	1131
1141	california	461
1142	predicted	517
1143	kind	440
1144	ideas	235
1145	downhill	18
1146	observed	1242
1147	rent	48
1148	failure	172
1149	twelve	42
1150	manifest	27
1151	reduce	499
1152	i00	13
1153	cur	55
1154	satisfying	126
1155	coordinates	433
1156	thought	220
1157	successes	27
1158	seeking	23
1159	leaves	201
1160	vec	83
1161	law	318
1162	illustrates	259
1163	ranges	117
1164	die	89
1165	radius	135
1166	inhibition	624
1167	attrac	11
1168	limb	46
1169	planning	331
1170	hand	1641
1171	depict	88
1172	drawn	477
1173	mistake	157
1174	slightly	416
1175	largest	450
1176	combined	626
1177	unknown	709
1178	david	419
1179	eye	1163
1180	serve	148
1181	minima	410
1182	share	164
1183	beginning	175
1184	continuous	1600
1185	producing	179
1186	spread	184
1187	range	1649
1188	showing	279
1189	propagated	112
1190	grown	30
1191	head	735
1192	tor	126
1193	determining	323
1194	grow	246
1195	initialized	211
1196	formulation	355
1197	declines	12
1198	cited	17
1199	activa	30
1200	key	373
1201	winning	104
1202	happen	173
1203	cartesian	71
1204	exit	16
1205	usage	94
1206	worth	77
1207	euclidean	379
1208	darker	35
1209	morristown	13
1210	coordi	13
1211	context	1626
1212	backpropagated	23
1213	quality	419
1214	scarce	12
1215	improvement	699
1216	reduced	668
1217	fashion	233
1218	suffices	57
1219	pure	167
1220	sure	69
1221	aspect	536
1222	strategy	578
1223	moving	614
1224	gradually	183
1225	ping	67
1226	biggest	14
1227	iol	10
1228	reaching	134
1229	displayed	108
1230	posi	34
1231	overshoot	34
1232	planar	126
1233	pole	121
1234	positioning	50
1235	big	92
1236	essentially	292
1237	simultaneously	402
1238	avoid	441
1239	stronger	125
1240	forcement	29
1241	comes	175
1242	temporary	25
1243	decay	694
1244	multidimensional	163
1245	closing	28
1246	apparently	65
1247	petitive	9
1248	traditional	285
1249	accurate	477
1250	standpoint	28
1251	dissertation	50
1252	depending	369
1253	pushed	33
1254	ata	12
1255	pose	153
1256	sense	545
1257	causing	87
1258	characterizing	66
1259	highlight	49
1260	possibilities	80
1261	ble	57
1262	stabilizes	19
1263	creating	100
1264	speed	930
1265	commun	19
1266	environ	32
1267	drawback	105
1268	cheap	24
1269	shift	511
1270	easy	418
1271	stimulus	1470
1272	sophistication	12
1273	clip	14
1274	govern	45
1275	controlling	119
1276	monotonically	106
1277	forget	16
1278	spacing	62
1279	fast	826
1280	lines	752
1281	gmdh	36
1282	captured	107
1283	polynomial	779
1284	resolution	672
1285	physiological	241
1286	exemplar	287
1287	plagued	8
1288	troller	19
1289	hierarchy	213
1290	articulation	49
1291	equa	48
1292	hierarchies	77
1293	accomplished	138
1294	assumes	219
1295	filter	1761
1296	notice	288
1297	chaos	96
1298	cmac	113
1299	hash	16
1300	acknowledge	91
1301	fine	318
1302	reason	498
1303	observable	284
1304	domain	1220
1305	priori	343
1306	collision	56
1307	alamos	46
1308	satisfied	185
1309	lapedes	61
1310	divide	90
1311	friedman	193
1312	determination	135
1313	techniques	1299
1314	letter	667
1315	explicit	458
1316	normalized	663
1317	minutes	134
1318	glass	183
1319	kraft	10
1320	splines	182
1321	mosaic	36
1322	multiple	1338
1323	structures	597
1324	table	1926
1325	lattice	182
1326	sion	158
1327	alway	810
1328	completely	364
1329	lookup	83
1330	absence	246
1331	instantaneous	153
1332	ninth	30
1333	chris	70
1334	imation	48
1335	miller	320
1336	mind	92
1337	wide	493
1338	separate	594
1339	timeseries	15
1340	amount	870
1341	magnitude	604
1342	yale	101
1343	hashing	12
1344	storage	504
1345	lee	399
1346	glanz	12
1347	immediately	174
1348	dramatic	64
1349	trees	559
1350	unlike	256
1351	virtual	159
1352	pronounce	13
1353	generally	494
1354	notation	289
1355	overlapping	232
1356	dis	267
1357	scaling	566
1358	symmetric	524
1359	continuously	153
1360	formulated	147
1361	radial	498
1362	face	772
1363	past	350
1364	entire	529
1365	poster	8
1366	tenorio	40
1367	coarse	236
1368	kaufmann	712
1369	constitutes	84
1370	farmer	16
1371	tran	567
1372	extremely	226
1373	integrating	172
1374	fitting	360
1375	wiener	29
1376	flexibility	133
1377	sidorowich	12
1378	nearby	128
1379	manipulator	111
1380	estimates	910
1381	preserved	80
1382	farber	29
1383	expensive	195
1384	moody	525
1385	purdue	26
1386	wadsworth	20
1387	terry	20
1388	projected	194
1389	mode	677
1390	contribution	535
1391	physical	376
1392	varied	247
1393	reference	459
1394	conjugate	182
1395	computationally	322
1396	adelson	72
1397	capturing	43
1398	stone	102
1399	college	147
1400	directly	917
1401	spline	247
1402	laplacian	73
1403	easily	684
1404	adapt	262
1405	interpolation	387
1406	summer	103
1407	parametric	261
1408	gratefully	63
1409	publisher	232
1410	spaces	367
1411	projection	988
1412	los	113
1413	brain	994
1414	rectangular	62
1415	meaning	211
1416	purpose	352
1417	engineering	563
1418	fined	21
1419	albus	49
1420	encounter	39
1421	stored	490
1422	thomas	139
1423	discontinuities	137
1424	sumed	13
1425	proceeding	1028
1426	efficiently	307
1427	wise	65
1428	mackey	76
1429	touretzky	526
1430	circle	175
1431	precisely	186
1432	neighbor	827
1433	correction	279
1434	resolved	47
1435	mary	28
1436	lie	300
1437	classes	1215
1438	sur	43
1439	significantly	669
1440	repeatedly	108
1441	coarser	23
1442	contrast	1083
1443	edward	65
1444	ita	15
1445	costly	38
1446	begin	334
1447	look	392
1448	fuzzy	187
1449	disciplines	10
1450	grateful	69
1451	sun	188
1452	complicated	224
1453	darken	138
1454	adjacent	192
1455	intrinsically	41
1456	lattices	20
1457	boundaries	325
1458	piece	97
1459	cal	146
1460	cast	66
1461	fractal	68
1462	kalman	295
1463	multitude	11
1464	excellent	122
1465	suited	157
1466	predicting	233
1467	predictive	416
1468	easiest	14
1469	scales	432
1470	quired	20
1471	localized	166
1472	modes	320
1473	substantially	176
1474	replaced	243
1475	classical	359
1476	community	86
1477	require	720
1478	neighboring	258
1479	sejnowski	591
1480	series	1041
1481	conventional	581
1482	finest	13
1483	insures	16
1484	resulted	135
1485	helpful	249
1486	casdagli	21
1487	cyclic	34
1488	takes	564
1489	offer	223
1490	nettalk	50
1491	termination	64
1492	vary	277
1493	included	306
1494	combiner	14
1495	intensive	70
1496	faster	474
1497	purposes	183
1498	generates	217
1499	conquer	14
1500	required	1335
1501	worker	28
1502	retaining	36
1503	alan	60
1504	combine	254
1505	fly	89
1506	guarantees	117
1507	school	246
1508	updated	379
1509	lies	179
1510	introduces	120
1511	controller	991
1512	earlier	368
1513	graded	76
1514	efficiency	320
1515	modification	417
1516	yielding	150
1517	correspond	1290
1518	intended	108
1519	cray	14
1520	chaotic	227
1521	vertices	116
1522	universal	194
1523	build	350
1524	cerebellar	117
1525	formal	193
1526	evaluated	388
1527	interval	924
1528	imple	58
1529	morgan	996
1530	pre	627
1531	global	1139
1532	afosr	77
1533	simplest	208
1534	improve	602
1535	classifica	34
1536	rameter	67
1537	underlying	702
1538	emerges	49
1539	minimization	378
1540	finer	55
1541	haven	38
1542	automation	48
1543	omohundro	115
1544	modified	555
1545	trade	150
1546	reduction	532
1547	held	130
1548	achieving	91
1549	evaluation	703
1550	typically	703
1551	tables	99
1552	drop	164
1553	overcome	123
1554	noted	211
1555	schematically	28
1556	regression	1245
1557	column	765
1558	consideration	234
1559	operation	947
1560	multigrid	14
1561	primary	446
1562	jon	7
1563	characterized	320
1564	pyramid	191
1565	exploited	69
1566	tend	420
1567	robotic	181
1568	adjustable	157
1569	precision	378
1570	simpler	252
1571	dense	93
1572	sizes	365
1573	segment	960
1574	peter	219
1575	complex	1504
1576	index	516
1577	versatile	9
1578	allocation	163
1579	designed	450
1580	rnsec	11
1581	dimen	49
1582	moment	232
1583	multiresolution	62
1584	capture	303
1585	deal	289
1586	sigmoidal	458
1587	mentation	42
1588	simplifies	61
1589	follow	1409
1590	compact	291
1591	plateaus	14
1592	subsequent	246
1593	database	601
1594	exploiting	108
1595	focuses	51
1596	queen	26
1597	editor	742
1598	formulate	84
1599	qualities	23
1600	horizontal	523
1601	slow	389
1602	fig	2409
1603	statistic	961
1604	limit	1038
1605	caused	202
1606	losing	66
1607	highly	559
1608	mexico	28
1609	box	332
1610	varying	579
1611	software	272
1612	cod	14
1613	vision	906
1614	tuned	419
1615	initially	346
1616	cycles	302
1617	optimization	1224
1618	wasteful	13
1619	code	910
1620	sparse	552
1621	isotropic	80
1622	involves	403
1623	hood	46
1624	deviation	662
1625	weaknesses	24
1626	london	194
1627	especially	334
1628	regular	336
1629	spite	61
1630	formu	8
1631	approx	99
1632	module	595
1633	wasted	17
1634	allocating	39
1635	graphic	94
1636	carter	4
1637	byte	19
1638	applica	38
1639	regardless	128
1640	attain	38
1641	majority	195
1642	strange	22
1643	cost	1741
1644	ficient	30
1645	vertex	105
1646	distribu	78
1647	architectures	566
1648	phoneme	413
1649	gabor	143
1650	recently	600
1651	english	178
1652	successfully	319
1653	disappear	52
1654	factor	1617
1655	start	646
1656	running	290
1657	imply	117
1658	benchmark	260
1659	picture	145
1660	power	1072
1661	stage	809
1662	orbit	55
1663	characteristic	696
1664	corn	46
1665	comparable	222
1666	quickly	291
1667	rosenberg	59
1668	measured	801
1669	illustration	77
1670	spectrum	388
1671	creation	51
1672	book	143
1673	necessarily	211
1674	fitted	87
1675	inspired	137
1676	sensor	559
1677	text	450
1678	eliminated	132
1679	access	272
1680	delay	1220
1681	saving	82
1682	surfaces	228
1683	assigned	349
1684	sequentially	100
1685	exact	584
1686	periodic	259
1687	fit	842
1688	mflop	14
1689	growing	169
1690	proximity	114
1691	dimensionality	431
1692	olshen	24
1693	disparate	19
1694	lated	59
1695	differential	538
1696	polak	16
1697	attention	657
1698	inherent	142
1699	tational	25
1700	luenberger	14
1701	tributed	23
1702	scott	45
1703	superiority	35
1704	age	140
1705	supplied	54
1706	greg	11
1707	direction	2465
1708	created	231
1709	epoch	610
1710	character	1152
1711	prentice	112
1712	momentum	255
1713	noisy	730
1714	derivatives	439
1715	entered	35
1716	count	247
1717	terminates	47
1718	geoffrey	92
1719	progress	139
1720	fahlman	101
1721	employed	260
1722	suf	16
1723	guarantee	133
1724	bad	115
1725	wealth	21
1726	handwritten	349
1727	hillis	14
1728	hot	28
1729	erlbaum	103
1730	cross	1148
1731	powell	20
1732	sufficiently	329
1733	kramer	66
1734	mellon	169
1735	rcr	10
1736	encoding	523
1737	calif	19
1738	signif	20
1739	ribiere	16
1740	rithm	224
1741	requirement	379
1742	sim	115
1743	match	595
1744	manner	430
1745	microstructure	80
1746	lit	53
1747	vol	1033
1748	berkeley	202
1749	classic	75
1750	insignificant	18
1751	user	584
1752	effective	777
1753	simplified	257
1754	parallelizable	13
1755	fewer	244
1756	iterative	379
1757	hall	247
1758	avg	41
1759	fid	9
1760	pro	428
1761	defines	212
1762	steepest	90
1763	reflect	338
1764	split	346
1765	wall	86
1766	naive	152
1767	roughly	363
1768	smallest	234
1769	setup	78
1770	sweep	115
1771	incrementally	96
1772	vincentelli	18
1773	linesearch	20
1774	written	438
1775	entry	106
1776	evaluate	388
1777	englewood	50
1778	improving	213
1779	robust	623
1780	looked	23
1781	initializing	28
1782	wij	280
1783	structured	206
1784	acceptable	86
1785	straightforward	312
1786	asking	24
1787	sangiovanni	18
1788	jan	49
1789	specifically	319
1790	gramming	25
1791	thresh	48
1792	ith	221
1793	batch	357
1794	tried	160
1795	mazimum	9
1796	becker	116
1797	instance	715
1798	length	1282
1799	broadcast	33
1800	importance	311
1801	alg	10
1802	ation	73
1803	full	870
1804	capital	55
1805	formed	382
1806	variation	692
1807	iter	33
1808	invariance	306
1809	addison	143
1810	relative	1130
1811	hessian	256
1812	tum	42
1813	cun	302
1814	memo	71
1815	dominated	78
1816	summarized	155
1817	incremental	264
1818	mixed	227
1819	determines	316
1820	henceforth	29
1821	unique	402
1822	restart	62
1823	ceeding	41
1824	parallelism	71
1825	mass	232
1826	recursively	96
1827	numerically	130
1828	advantage	603
1829	massively	68
1830	travel	73
1831	inexact	10
1832	concern	94
1833	paradigm	327
1834	describing	176
1835	pittsburgh	148
1836	framework	965
1837	superior	308
1838	demonstrate	507
1839	despite	201
1840	wesley	151
1841	taking	469
1842	owij	30
1843	wolfe	33
1844	infinity	96
1845	estimated	883
1846	approximating	280
1847	mouse	21
1848	inherently	47
1849	sev	24
1850	requiring	166
1851	carnegie	168
1852	distinct	394
1853	refer	395
1854	exploit	165
1855	indicating	209
1856	mateo	484
1857	icant	11
1858	cliff	59
1859	acknowledgment	286
1860	practical	615
1861	emphasized	70
1862	seemingly	30
1863	eec	17
1864	eral	57
1865	controlled	377
1866	confine	13
1867	usual	266
1868	sue	10
1869	mer	12
1870	exploitation	42
1871	opposite	216
1872	logistic	217
1873	derivative	505
1874	prob	288
1875	successively	48
1876	reading	240
1877	valley	41
1878	interconnection	174
1879	objective	701
1880	implementing	185
1881	pursued	35
1882	product	902
1883	free	871
1884	terminating	19
1885	concept	744
1886	art	170
1887	algo	228
1888	speedup	93
1889	percentage	204
1890	ratio	676
1891	numerical	478
1892	higher	1310
1893	services	23
1894	educational	10
1895	modifies	35
1896	finite	1239
1897	partly	47
1898	putation	44
1899	investigate	252
1900	jersey	48
1901	issues	261
1902	rior	14
1903	genetic	328
1904	modify	128
1905	lawrence	120
1906	subtract	41
1907	message	205
1908	classifier	2340
1909	list	306
1910	laboratories	190
1911	active	1059
1912	added	591
1913	matches	246
1914	companion	12
1915	post	314
1916	source	1024
1917	periodically	47
1918	link	514
1919	seen	846
1920	inductive	105
1921	introduced	594
1922	altered	73
1923	send	88
1924	accommodate	42
1925	exciting	33
1926	exploring	120
1927	leading	269
1928	parent	260
1929	strongest	36
1930	stochastic	1621
1931	holland	114
1932	goldberg	53
1933	crossover	94
1934	effector	39
1935	raised	47
1936	stochastically	57
1937	bid	24
1938	population	788
1939	portion	275
1940	cycle	402
1941	commonly	186
1942	reader	123
1943	referred	215
1944	replace	164
1945	superset	11
1946	alphabet	134
1947	sort	159
1948	vation	40
1949	add	447
1950	excess	64
1951	care	76
1952	environmental	98
1953	weighting	359
1954	messages	102
1955	matched	236
1956	reproduction	30
1957	transformation	1155
1958	assumed	700
1959	das	48
1960	organize	21
1961	activated	295
1962	street	93
1963	handled	64
1964	davis	97
1965	bbn	27
1966	architectural	60
1967	proof	890
1968	linked	96
1969	winner	404
1970	concluding	20
1971	belew	23
1972	simplification	73
1973	prior	1635
1974	neu	216
1975	conjecture	84
1976	employing	77
1977	alteration	33
1978	complication	57
1979	matching	697
1980	derived	828
1981	evolution	386
1982	stages	376
1983	employ	249
1984	quantity	279
1985	prove	318
1986	supplies	23
1987	ral	117
1988	wonder	11
1989	incoming	144
1990	varieties	15
1991	paul	144
1992	preparation	139
1993	boxes	88
1994	attempt	468
1995	passed	152
1996	children	127
1997	isomorphic	26
1998	michael	350
1999	entities	35
2000	latched	8
2001	processed	177
2002	rig	15
2003	january	66
2004	acti	24
2005	favoring	21
2006	port	79
2007	measurement	599
2008	craig	13
2009	reverse	101
2010	climbing	119
2011	potentially	179
2012	receive	257
2013	turn	632
2014	maze	57
2015	tracking	392
2016	mutation	59
2017	invoked	21
2018	gained	75
2019	treated	168
2020	axe	70
2021	affect	307
2022	produced	597
2023	carry	118
2024	cycling	20
2025	handle	199
2026	inspection	47
2027	analogous	224
2028	composed	283
2029	introduce	451
2030	ron	119
2031	accomplish	58
2032	subtracting	52
2033	incorporating	146
2034	operate	150
2035	specialization	66
2036	child	121
2037	guide	126
2038	evolve	72
2039	counting	116
2040	obvious	219
2041	formalism	190
2042	impression	13
2043	view	1352
2044	sending	49
2045	carried	249
2046	extension	479
2047	explanation	263
2048	wilson	123
2049	quotient	18
2050	conversion	57
2051	production	268
2052	markedly	20
2053	refinement	96
2054	strict	68
2055	benefited	11
2056	translation	443
2057	optimizing	141
2058	affecting	51
2059	concludes	20
2060	passes	158
2061	gorithm	102
2062	implement	570
2063	string	692
2064	traversing	15
2065	believe	214
2066	latch	24
2067	richard	219
2068	classifying	144
2069	altering	38
2070	corporation	95
2071	intemal	14
2072	induction	228
2073	leaving	83
2074	stewart	12
2075	goes	156
2076	technologies	68
2077	pointer	87
2078	negation	27
2079	traditionally	31
2080	generator	204
2081	equivalence	157
2082	preserving	90
2083	ternary	10
2084	exceeded	31
2085	verify	91
2086	suggested	382
2087	paid	28
2088	applying	419
2089	ted	28
2090	recurrent	1531
2091	benefit	242
2092	attached	62
2093	inactive	56
2094	bias	877
2095	correspondence	271
2096	preceding	181
2097	searcher	8
2098	analog	1651
2099	considering	290
2100	sonn	52
2101	accept	127
2102	rissanen	61
2103	adjust	193
2104	transfer	685
2105	demand	108
2106	terminal	291
2107	searches	74
2108	organizing	385
2109	construction	377
2110	mackay	312
2111	annealing	489
2112	tool	332
2113	making	611
2114	temperature	476
2115	tentative	36
2116	simplistic	22
2117	mdl	94
2118	sec	368
2119	iii	443
2120	interpolate	49
2121	restoration	60
2122	observation	1162
2123	hypersurface	22
2124	partially	329
2125	pami	81
2126	coefficient	884
2127	subsection	33
2128	rmse	42
2129	arbitrarily	215
2130	hierarchically	25
2131	generating	420
2132	energy	1378
2133	simulator	171
2134	stop	282
2135	estimator	682
2136	lafayette	12
2137	loop	570
2138	schedule	289
2139	aixi	13
2140	electrical	384
2141	acceptance	32
2142	constructed	522
2143	relaxation	288
2144	x10	10
2145	connectivity	381
2146	autoregressive	44
2147	continue	119
2148	variables	2133
2149	resources	140
2150	spirit	48
2151	extended	524
2152	ideal	228
2153	implies	392
2154	density	1718
2155	likelihood	1732
2156	analyzed	200
2157	gdr	10
2158	dominant	112
2159	fall	276
2160	kolmogorov	40
2161	varies	167
2162	true	1130
2163	fie	12
2164	disadvantages	33
2165	geman	158
2166	root	262
2167	substructures	39
2168	smaller	642
2169	accepting	38
2170	accepted	123
2171	tim	48
2172	flexible	174
2173	fernando	25
2174	adjustment	89
2175	unable	90
2176	mal	28
2177	incorporate	178
2178	academic	224
2179	guided	80
2180	pool	238
2181	collection	293
2182	creates	83
2183	dam	26
2184	repeat	154
2185	dim	56
2186	iee	22
2187	variant	266
2188	extrapolate	20
2189	selection	1075
2190	wei	12
2191	versus	395
2192	multilayered	18
2193	listed	84
2194	shortest	116
2195	primitive	111
2196	named	36
2197	criteria	287
2198	advantages	320
2199	prototype	231
2200	recall	337
2201	usefulness	57
2202	degree	722
2203	major	314
2204	bayesian	1345
2205	optimizes	40
2206	provision	13
2207	draw	139
2208	hundred	139
2209	discard	34
2210	opportunity	29
2211	shares	39
2212	topology	337
2213	cooling	30
2214	discrete	979
2215	gibb	248
2216	optimum	194
2217	including	710
2218	penalty	352
2219	corrupted	147
2220	chooses	113
2221	rank	244
2222	vice	64
2223	calculation	527
2224	alternate	65
2225	saddle	144
2226	emergence	106
2227	eigenvalue	270
2228	restriction	210
2229	nsf	179
2230	matrices	520
2231	propaga	11
2232	landscapes	41
2233	subspaces	69
2234	technology	663
2235	prescribed	42
2236	ordinary	143
2237	learnt	59
2238	pression	20
2239	multiplication	197
2240	convex	384
2241	chauvin	65
2242	intersection	97
2243	exhibit	406
2244	iterates	32
2245	unreasonable	16
2246	conversely	71
2247	particu	26
2248	heuristically	22
2249	compo	55
2250	aij	83
2251	orthonormal	52
2252	analyzer	58
2253	transpose	46
2254	admissible	70
2255	spa	45
2256	oscillatory	304
2257	detecting	171
2258	discovery	130
2259	rewritten	61
2260	spanned	72
2261	nice	41
2262	hyperplane	177
2263	obviously	123
2264	decomposing	23
2265	decomposed	88
2266	avoided	69
2267	deep	80
2268	multiplicity	13
2269	escape	98
2270	landscape	75
2271	fix	138
2272	propulsion	50
2273	induced	274
2274	extend	366
2275	readily	153
2276	ima	17
2277	jet	62
2278	trices	12
2279	exceed	177
2280	iff	72
2281	cottrell	132
2282	denotes	618
2283	incorporates	91
2284	forced	89
2285	publication	103
2286	feeling	9
2287	invertible	62
2288	equivalently	82
2289	understood	155
2290	assert	29
2291	versa	59
2292	compression	300
2293	anymore	12
2294	lar	52
2295	concisely	9
2296	adopted	98
2297	includes	358
2298	nent	62
2299	autoassociative	35
2300	satisfy	250
2301	verge	10
2302	understand	235
2303	rates	1088
2304	demonstration	129
2305	impose	78
2306	plication	35
2307	formally	127
2308	word	2343
2309	constrained	449
2310	existence	233
2311	motivation	126
2312	sharkey	11
2313	pasadena	155
2314	baldi	105
2315	zipser	95
2316	collapsed	13
2317	presence	444
2318	bet	22
2319	algorithmic	58
2320	pierre	38
2321	advances	980
2322	terrain	15
2323	constitute	87
2324	amples	28
2325	proper	213
2326	bottleneck	54
2327	covariance	795
2328	externally	56
2329	encountered	116
2330	noticed	37
2331	hornik	75
2332	ily	21
2333	positioned	27
2334	check	157
2335	connecting	123
2336	fairly	199
2337	plr	37
2338	schwartz	118
2339	solla	166
2340	incident	37
2341	domany	31
2342	tesauro	283
2343	broken	96
2344	realized	135
2345	arrived	21
2346	imagine	82
2347	developing	197
2348	circumvent	26
2349	unity	129
2350	experience	275
2351	tal	45
2352	tation	189
2353	grossman	40
2354	guess	89
2355	wiley	236
2356	logically	14
2357	wrong	141
2358	parametrized	70
2359	symmetry	289
2360	plausible	226
2361	exhaustive	99
2362	adjacency	15
2363	biologically	161
2364	eytan	28
2365	session	142
2366	optimized	268
2367	reasonable	367
2368	clump	53
2369	integer	321
2370	plaut	26
2371	execute	78
2372	york	633
2373	keeping	124
2374	perceptton	320
2375	flip	98
2376	dealing	127
2377	ahd	25
2378	implausible	18
2379	completed	57
2380	illl	17
2381	spartan	11
2382	predicate	31
2383	loss	995
2384	median	133
2385	choices	184
2386	caught	9
2387	ili	12
2388	rehovot	12
2389	calculating	154
2390	enables	150
2391	stuck	58
2392	meir	70
2393	conceptually	34
2394	rosenblatt	26
2395	janssen	19
2396	limiting	157
2397	apply	600
2398	presenting	83
2399	solved	393
2400	sites	167
2401	treating	72
2402	searching	103
2403	sign	442
2404	partition	545
2405	updating	263
2406	repre	137
2407	executing	55
2408	unidirectional	17
2409	impossible	133
2410	rejecting	27
2411	generality	132
2412	contiguous	24
2413	imax	10
2414	revealed	94
2415	represen	76
2416	site	187
2417	hopfield	452
2418	credit	161
2419	sentation	86
2420	coupling	358
2421	belong	233
2422	howard	164
2423	lem	158
2424	feasible	136
2425	occurrences	44
2426	separately	183
2427	insert	46
2428	weizmann	17
2429	abort	12
2430	hardware	514
2431	chose	152
2432	corrective	60
2433	ques	10
2434	paperr	10
2435	contiguity	18
2436	vanishing	50
2437	bear	65
2438	treat	141
2439	lewis	51
2440	err	51
2441	fraction	396
2442	ronny	11
2443	reflection	69
2444	say	358
2445	iin	15
2446	constructing	189
2447	fundamental	238
2448	tin	90
2449	calculate	347
2450	applicable	243
2451	flipping	17
2452	logic	210
2453	winter	41
2454	pick	161
2455	sour	11
2456	didn	21
2457	israel	114
2458	restrictive	45
2459	wittner	11
2460	walk	80
2461	neurodynamic	36
2462	increment	144
2463	chir	28
2464	explained	182
2465	picking	62
2466	round	87
2467	tra	36
2468	separable	195
2469	extending	126
2470	tries	106
2471	jackel	108
2472	changing	403
2473	complez	17
2474	enable	95
2475	plp	23
2476	force	447
2477	minsky	45
2478	attempted	84
2479	loo	113
2480	appealing	57
2481	plotted	323
2482	existing	329
2483	serving	29
2484	inserted	40
2485	insensitive	103
2486	gap	257
2487	theorem	1469
2488	crl	46
2489	princeton	146
2490	address	535
2491	oct	77
2492	rep	164
2493	protein	233
2494	knew	15
2495	overestimate	22
2496	corollary	118
2497	logn	14
2498	freedom	224
2499	formulae	57
2500	measures	508
2501	derive	438
2502	advance	109
2503	overview	123
2504	chervonenkis	88
2505	verlag	267
2506	shattered	52
2507	inequality	207
2508	phoneroes	19
2509	loaded	47
2510	read	186
2511	kearn	111
2512	capacity	709
2513	initiative	20
2514	secondary	159
2515	occam	59
2516	zation	20
2517	sketch	75
2518	closely	316
2519	ignoring	71
2520	exponentially	248
2521	chances	9
2522	shifting	81
2523	dependences	33
2524	attributes	231
2525	deleted	74
2526	geometrical	89
2527	establish	132
2528	strategic	12
2529	base	455
2530	event	751
2531	vapnik	300
2532	treatment	112
2533	bull	22
2534	hope	122
2535	families	65
2536	consid	16
2537	cruz	51
2538	discuss	316
2539	realizable	66
2540	ehrenfeucht	25
2541	sink	21
2542	devroye	20
2543	eric	113
2544	warmuth	117
2545	approximately	566
2546	outgoing	47
2547	fil	37
2548	attacked	11
2549	priate	13
2550	backgammon	79
2551	associating	26
2552	permission	27
2553	hypercube	85
2554	razor	32
2555	interest	595
2556	vap82	6
2557	dent	47
2558	eli	21
2559	load	336
2560	dichotomy	46
2561	irrelevant	153
2562	accu	30
2563	probabilities	1211
2564	tribution	78
2565	comp	267
2566	springer	371
2567	playing	67
2568	aloud	16
2569	sauer	16
2570	vcdim	28
2571	issue	291
2572	recognizing	178
2573	biophy	27
2574	hart	95
2575	plexity	40
2576	signed	47
2577	slice	124
2578	deg	97
2579	removing	130
2580	era	38
2581	adaline	20
2582	uniformly	309
2583	receives	295
2584	revised	27
2585	indepen	44
2586	generalizes	113
2587	rectly	20
2588	abound	12
2589	rivest	55
2590	math	227
2591	int	242
2592	independently	401
2593	logarithm	109
2594	gence	42
2595	verified	81
2596	capabilities	185
2597	analogy	116
2598	acyclic	47
2599	confidence	431
2600	closer	177
2601	ucsc	35
2602	fruitful	29
2603	sharper	24
2604	lit88	10
2605	cardinality	43
2606	elect	12
2607	santa	113
2608	speech	2315
2609	frequencies	405
2610	appendix	106
2611	plane	449
2612	dichotomies	67
2613	disjoint	105
2614	lemma	361
2615	crude	61
2616	classifies	88
2617	counteract	17
2618	thresholding	82
2619	aeronautic	19
2620	lay	34
2621	restricted	356
2622	concomitant	12
2623	inl	9
2624	slicing	14
2625	confusion	89
2626	ples	49
2627	degrees	351
2628	rnn	92
2629	confi	9
2630	pollard	22
2631	visiting	20
2632	worst	186
2633	automatic	338
2634	extraction	425
2635	removed	230
2636	eor	12
2637	dependence	386
2638	shortly	41
2639	aip	20
2640	doesn	61
2641	blumer	41
2642	rem	41
2643	anderson	279
2644	ill	277
2645	dence	43
2646	disagrees	10
2647	exam	84
2648	appro	22
2649	nick	15
2650	racy	15
2651	hen	20
2652	littlestone	59
2653	play	381
2654	entropy	810
2655	architec	55
2656	quantifying	19
2657	shatter	20
2658	appropriately	121
2659	specialize	23
2660	thumb	37
2661	agreement	219
2662	conf	295
2663	ture	151
2664	ana	32
2665	composing	19
2666	completeness	43
2667	desire	33
2668	duda	73
2669	unavoidable	12
2670	giving	214
2671	expert	1231
2672	certainty	90
2673	intelli	8
2674	span	201
2675	perspectives	28
2676	inequalities	52
2677	learnability	76
2678	diverse	87
2679	aid	66
2680	administration	24
2681	whe	8
2682	scene	462
2683	denoted	462
2684	literal	62
2685	protocol	48
2686	uphill	10
2687	mfa	44
2688	spin	288
2689	experimentally	165
2690	nical	24
2691	den	114
2692	ece	38
2693	attractive	119
2694	vecchi	19
2695	exp	916
2696	bout	23
2697	highest	267
2698	quenched	13
2699	balances	15
2700	ssa	30
2701	analytically	229
2702	averages	224
2703	div	7
2704	resembles	69
2705	combi	21
2706	negligible	116
2707	eration	26
2708	traces	151
2709	analytic	208
2710	saturate	38
2711	crt	8
2712	mann	66
2713	hamiltonjan	15
2714	poor	263
2715	ridge	160
2716	gelatt	15
2717	zip	82
2718	tank	92
2719	generic	164
2720	bin	246
2721	saw	27
2722	hamiltonian	59
2723	nearly	258
2724	ising	25
2725	attracted	32
2726	tanh	223
2727	bilbro	28
2728	markov	1268
2729	motion	1910
2730	involved	266
2731	multiprocessor	9
2732	thermal	62
2733	simplify	120
2734	nected	24
2735	thouless	19
2736	lowered	38
2737	began	40
2738	unstable	201
2739	effected	15
2740	met	71
2741	compares	157
2742	respective	107
2743	updates	398
2744	completing	14
2745	icnn	23
2746	selecting	313
2747	interacting	76
2748	raleigh	12
2749	diverge	44
2750	forces	189
2751	martin	161
2752	tem	213
2753	combinatorial	105
2754	snyder	35
2755	chain	528
2756	eng	110
2757	annealed	85
2758	kirkpatrick	52
2759	coupled	312
2760	carolina	15
2761	factoring	15
2762	calculated	565
2763	established	204
2764	equilibrium	328
2765	depicted	184
2766	schedules	129
2767	possessing	17
2768	trivially	26
2769	palmer	60
2770	north	110
2771	patrick	17
2772	freeze	24
2773	frame	628
2774	repulsive	11
2775	physicist	13
2776	divided	304
2777	iterating	39
2778	replaces	42
2779	processor	517
2780	array	608
2781	evidenced	16
2782	revealing	22
2783	portant	19
2784	temperatures	96
2785	transition	1353
2786	endpoint	64
2787	idealized	28
2788	break	156
2789	content	312
2790	boltzmann	447
2791	solvable	58
2792	oak	23
2793	derivation	247
2794	amorphous	23
2795	partitioning	158
2796	mag	29
2797	freezing	16
2798	kirk	38
2799	peterson	114
2800	balance	123
2801	iterated	99
2802	maximally	77
2803	empirically	174
2804	sat	36
2805	lab	224
2806	perature	9
2807	iteratively	115
2808	bisection	9
2809	agrees	53
2810	decreased	145
2811	opti	63
2812	mcc	17
2813	objectives	45
2814	predominantly	20
2815	disordered	20
2816	arising	81
2817	holding	76
2818	severity	12
2819	tuning	593
2820	insufficient	61
2821	optimiza	28
2822	decision	1707
2823	settles	32
2824	relax	40
2825	attraction	97
2826	phil	35
2827	movement	1137
2828	luminanee	4
2829	particles	41
2830	conceptual	53
2831	drift	149
2832	compensate	82
2833	attract	10
2834	abruptly	11
2835	distributing	12
2836	mization	42
2837	surprising	115
2838	ordering	170
2839	alternatives	74
2840	default	109
2841	game	256
2842	enforce	68
2843	informa	96
2844	formidable	10
2845	exploration	459
2846	absolute	340
2847	score	292
2848	advocate	8
2849	scoring	136
2850	sition	47
2851	ally	50
2852	board	312
2853	yorktown	18
2854	areas	439
2855	engaged	12
2856	specialist	12
2857	sured	16
2858	boa	10
2859	gle	14
2860	vastly	16
2861	fir	76
2862	rejected	73
2863	separation	592
2864	tha	22
2865	improves	208
2866	gammontool	13
2867	ensures	119
2868	illinois	53
2869	teaching	41
2870	gammon	52
2871	intrinsic	253
2872	extent	194
2873	uninteresting	13
2874	qualitatively	125
2875	scores	239
2876	separated	231
2877	substantial	150
2878	previ	32
2879	titis	12
2880	vast	34
2881	watson	45
2882	ial	10
2883	hoped	23
2884	netw	9
2885	ated	41
2886	raw	181
2887	cid	9
2888	rsp	13
2889	oval	16
2890	consistency	150
2891	naturally	221
2892	specialized	114
2893	agation	31
2894	gram	73
2895	teach	27
2896	enforced	34
2897	invert	37
2898	ode	19
2899	schemes	288
2900	consuming	63
2901	won	30
2902	aut	8
2903	scheme	869
2904	constantly	27
2905	tot	35
2906	understanding	374
2907	remarkable	63
2908	ensuring	37
2909	cube	58
2910	contained	294
2911	concerned	129
2912	indi	42
2913	games	117
2914	disease	66
2915	ibm	82
2916	guaranteed	173
2917	realizes	19
2918	ent	86
2919	preferred	287
2920	para	20
2921	opponent	59
2922	tit	44
2923	ined	10
2924	striking	52
2925	tral	14
2926	played	56
2927	tives	19
2928	nation	35
2929	ntt	10
2930	importantly	74
2931	consis	19
2932	elimination	118
2933	alterna	17
2934	judged	49
2935	stated	111
2936	judgement	28
2937	huge	41
2938	ative	31
2939	sides	105
2940	distinguishing	54
2941	qian	19
2942	going	99
2943	und	18
2944	unexplained	11
2945	regard	114
2946	knowl	20
2947	univ	143
2948	evalu	13
2949	parison	20
2950	preferable	38
2951	len	28
2952	slower	160
2953	biol	212
2954	matter	125
2955	est	46
2956	policy	1230
2957	mea	65
2958	hid	55
2959	engineer	38
2960	widespread	27
2961	spec	33
2962	eff	11
2963	inversion	198
2964	mon	29
2965	perf	26
2966	mcclelland	264
2967	gallant	35
2968	solely	86
2969	decent	14
2970	logical	129
2971	medicine	54
2972	dead	38
2973	judge	31
2974	isolation	54
2975	snn	125
2976	sophisticated	150
2977	tackled	13
2978	suitable	299
2979	unconstrained	67
2980	havior	25
2981	ting	27
2982	trick	43
2983	foreign	25
2984	thinking	28
2985	seriously	17
2986	option	169
2987	rst	14
2988	proves	47
2989	sensitivity	423
2990	economic	76
2991	sic	8
2992	rela	34
2993	arc	303
2994	fin	44
2995	solves	86
2996	rely	156
2997	ure	68
2998	miss	41
2999	crafted	22
3000	consistently	145
3001	merely	101
3002	gerald	32
3003	skeletonization	26
3004	mate	28
